/*
	6.3. 예제 3차원배열 : 층*행*열로 이루어진 배열
*/
#include <stdio.h>

void main(void) {
	int i, j, k = 0;
	//3차원배열 선언 : 2층*2행*2열
	int intNum[2][2][2]
		= {
			{			//0층
				{		//0행
					1,	//0열
					2
				},
				{		//1행
					3,	//0열
					4	//1열
				}
			},
			{	//1층
				{5, 6}, //0행
				{7, 8}  //1행
			}
	};//8공간
//초기화
/*
intNum[0][0][0] = 1;
intNum[0][0][1] = 2;
intNum[0][1][0] = 3;
intNum[0][1][1] = 4;
intNum[1][0][0] = 5;
intNum[1][0][1] = 6;
intNum[1][1][0] = 7;
intNum[1][1][1] = 8;
*/
//참조 : 다중 for문
	for (i = 0; i < 2; i++) {//층반복
		for (j = 0; j < 2; j++) {//행
			for (k = 0; k < 2; k++) {//열
				printf("%d "
					, intNum[i][j][k]);
			}
			printf("\n");//행구분
		}
		printf("\n");//층 구분
	}
}
